javascript.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-15 Tue 22:36 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JavaScript is LITERALLY GARBAGE</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="static/style.css" /><meta property="og:title" content="Soham's Website" /><meta property="og:url" content="https://sohamg.xyz" /><meta property="og:image"content="https://sohamg.xyz/img.png" /> <meta property="og:type" content="website" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">JavaScript is LITERALLY GARBAGE</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9866766">PLEASE STOP USING JAVASCRIPT</a>
<ul>
<li><a href="#org740c0f3">Reasons to stop using JavaScript</a></li>
</ul>
</li>
<li><a href="#org503b273">Can != Should</a></li>
<li><a href="#org5f8c857">What in the hell is a build tool?!</a></li>
<li><a href="#org09350e2">THIS WEBSITE USES JAVASCRIPT</a></li>
</ul>
</div>
</div>


<div id="outline-container-org9866766" class="outline-2">
<h2 id="org9866766">PLEASE STOP USING JAVASCRIPT</h2>
<div class="outline-text-2" id="text-org9866766">
</div>
<div id="outline-container-org740c0f3" class="outline-3">
<h3 id="org740c0f3">Reasons to stop using JavaScript</h3>
<div class="outline-text-3" id="text-org740c0f3">
<ol class="org-ol">
<li>Because I said so.</li>

<li>More reasons are left as an exercise to the reader.</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org503b273" class="outline-2">
<h2 id="org503b273">Can != Should</h2>
<div class="outline-text-2" id="text-org503b273">
<p>
Just because you <b><b>CAN</b></b> use javascript doesn't mean you <b><b>SHOULD</b></b>!!
</p>

<p>
NO, your personal blog doesn't need <span class="underline">REACT JS</span>!
</p>
</div>
</div>

<div id="outline-container-org5f8c857" class="outline-2">
<h2 id="org5f8c857">What in the hell is a build tool?!</h2>
<div class="outline-text-2" id="text-org5f8c857">
<p>
<b><b>WHY</b></b> do I need a build tool to use basically any javascript??
</p>
</div>
</div>

<div id="outline-container-org09350e2" class="outline-2">
<h2 id="org09350e2">THIS WEBSITE USES JAVASCRIPT</h2>
<div class="outline-text-2" id="text-org09350e2">
<p>
And it will probably crash by the time you're done reading!
</p>

<script>
setTimeout(() => {
while (1) {
console.log("JS BAD!");
}
}, 1000)
</script>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer><hr />Made with Emacs <br /> CC-BY-SA </footer>
</div>
</body>
</html>
